_posts/2021-12-19-abc225-d-upsolving.html
---
title: abc225 D - Play Train
tags: AtCoder
toc: true
toc_sticky: true
---

<div id="outline-container-orgf1c1348" class="outline-2">
<h2 id="orgf1c1348">D - Play Train</h2>
</div>

<div id="outline-container-org4cef650" class="outline-2">
<h2 id="org4cef650">접근하기</h2>
<div class="outline-text-2" id="text-org4cef650">
<pre class="example">
- 두 노드의 연결 O(1)
- 연결된 두 노드 분리 O(1)
- 번호를 이용해서 연결된 노드 출력하기 O(N)
- N이 10만이므로 list를 구성해서 풀이 가능
</pre>
</div>
</div>

<div id="outline-container-org7a69698" class="outline-2">
<h2 id="org7a69698">코드</h2>
<div class="outline-text-2" id="text-org7a69698">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">Q</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span> {
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">front</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">rear</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">a</span>[100010];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">out</span>[100010];
<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">print_func</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>) {

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">k</span> = num;
    <span style="color: #729fcf; font-weight: bold;">while</span>(a[k].front != 0) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">prev</span> = a[k].front;
        k = prev;
    }

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span> = 0;
     <span style="color: #729fcf; font-weight: bold;">while</span>(a[k].rear != 0) {
        out[idx++] = k;
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">next</span> = a[k].rear;
        k = next;
    }
    out[idx++] = k;

    printf(<span style="color: #ad7fa8; font-style: italic;">"%d "</span>, idx);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">register</span> <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;idx;i++) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d "</span>, out[i]);
    } 
    printf(<span style="color: #ad7fa8; font-style: italic;">"\n"</span>);
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;N, &amp;Q);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cmd</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num1</span>, <span style="color: #ff6347;">num2</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;Q;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;cmd);
        <span style="color: #729fcf; font-weight: bold;">switch</span>(cmd) {
        <span style="color: #729fcf; font-weight: bold;">case</span> 1:
            scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;num1, &amp;num2);
            a[num1].rear = num2;
            a[num2].front = num1;
            <span style="color: #729fcf; font-weight: bold;">break</span>;
        <span style="color: #729fcf; font-weight: bold;">case</span> 2:
            scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;num1, &amp;num2);
            a[num1].rear = 0;
            a[num2].front = 0;
            <span style="color: #729fcf; font-weight: bold;">break</span>;
        <span style="color: #729fcf; font-weight: bold;">case</span> 3:
            scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;num1);
            print_func(num1);
            <span style="color: #729fcf; font-weight: bold;">break</span>;
        }
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org20abddf" class="outline-2">
<h2 id="org20abddf">문제 링크</h2>
<div class="outline-text-2" id="text-org20abddf">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc225/tasks/abc225_d">https://atcoder.jp/contests/abc225/tasks/abc225_d</a></li>
</ul>
</div>
</div>
